In [3]:
import pandas as pd

In [4]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (8, 10, 11, 12),
        (13, 14, 15, 16)]
df = pd.DataFrame(data = data, index = "l1 l2 l3 l4".split(), columns = "c1 c2 c3 c4".split())
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [5]:
df['c1']

l1     1
l2     5
l3     8
l4    13
Name: c1, dtype: int64

In [6]:
df[['c3','c1']]

    c3  c1
l1   3   1
l2   7   5
l3  11   8
l4  15  13

In [7]:
# O ':' seleciona todas as linhas e colunas

df[:]

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [8]:
# A l1 eh a linha 0 no indice, por isso seleciona a l2

# A l4(linha 3 no indice) nao eh selecionada, e sim a l3(linha 2 no indice) pois a selecao nao chega ate o ultimo numero
# do indice ([1:3] = l2, l3,)

df[1:3]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12

In [9]:
df[1:][['c3', 'c1']]

    c3  c1
l2   7   5
l3  11   8
l4  15  13

In [10]:
df.loc['l3']

c1     8
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [11]:
df.loc[['l3', 'l2']]

    c1  c2  c3  c4
l3   8  10  11  12
l2   5   6   7   8

In [13]:
df.loc['l1', 'c2']

2

In [14]:
# loc a partir dos indices (iloc = index loc)

df.iloc[0, 1]

2

In [15]:
df.loc[['l3', 'l1'], ['c4', 'c1']]

    c4  c1
l3  12   8
l1   4   1

In [16]:
df.iloc[[2, 0], [3, 0]]

    c4  c1
l3  12   8
l1   4   1

# Exercicios propostos

## DataFrame de referencia:

In [17]:
alunos = pd.DataFrame({'Nome': ['Ary', 'Cátia', 'Denis', 'Beto', 'Bruna', 'Dara', 'Carlos', 'Alice'], 
                        'Sexo': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F'], 
                        'Idade': [15, 27, 56, 32, 42, 21, 19, 35], 
                        'Notas': [7.5, 2.5, 5.0, 10, 8.2, 7, 6, 5.6], 
                        'Aprovado': [True, False, False, True, True, True, False, False]}, 
                        columns = ['Nome', 'Idade', 'Sexo', 'Notas', 'Aprovado'])
alunos

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
1   Cátia     27    F    2.5     False
2   Denis     56    M    5.0     False
3    Beto     32    M   10.0      True
4   Bruna     42    F    8.2      True
5    Dara     21    F    7.0      True
6  Carlos     19    M    6.0     False
7   Alice     35    F    5.6     False

In [51]:
# Crie um DataFrame somente com os alunos reprovados e mantenha neste DataFrame apenas as colunas Nome, Sexo e Idade,
# nesta ordem.
slc = alunos.Aprovado == False
alunos.loc[slc, ['Nome', 'Sexo', 'Idade']]
# ou alunos[['Nome', 'Sexo', 'Idade']][slc]

     Nome Sexo  Idade
1   Cátia    F     27
2   Denis    M     56
6  Carlos    M     19
7   Alice    F     35

In [59]:
# Crie uma visualização com os três alunos mais novos.
alunos.sort_values(by = 'Idade', inplace = True)
alunos.iloc[:3]
# ou alunos[:3]

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
6  Carlos     19    M    6.0     False
5    Dara     21    F    7.0      True